app/controllers/characters_controller.rb

INSERT INTO "tmp_characters" ("json_data", "created_at", "updated_at") VALUES (?, ?, ?)
---
  def create_tmp_character
    data = TmpCharacter.new(character_params)
    data.save

SELECT  "tmp_characters".* FROM "tmp_characters" ORDER BY "tmp_characters"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def confirm
    @data = TmpCharacter.last

INSERT INTO "characters" ("json_data", "created_at", "updated_at") VALUES (?, ?, ?)
INSERT INTO "tmp_eyelets" ("json_data", "created_at", "updated_at") VALUES (?, ?, ?)
---
  def create_tmp_eyelet
    data = TmpEyelet.new(character_params)
    data.save

SELECT  "tmp_eyelets".* FROM "tmp_eyelets" ORDER BY "tmp_eyelets"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def name
    @character = Character.new
    @character.json_data = TmpEyelet.last.json_data

INSERT INTO "characters" ("name", "json_data", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    character = Character.new(character_name_params)
    character.save