app/controllers/scenes_controller.rb

SELECT  "scenes".* FROM "scenes" ORDER BY "scenes"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @scenes = Scene.all

SELECT "characters".* FROM "characters" ORDER BY "characters"."id" DESC
---
  def new
    @characters = Character.all

SELECT  "tmp_scenes".* FROM "tmp_scenes" ORDER BY "tmp_scenes"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def animate
    @scene = TmpScene.last

SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    id = params[:id]
    pre_id = id.to_i - 1
    next_id = id.to_i + 1
    @scene = Scene.find(params[:id])
    @scene.id == Scene.first.id ? @pre_scene = Scene.last : @pre_scene = Scene.find(pre_id)
    @scene.id == Scene.last.id ? @next_scene = Scene.first : @next_scene = Scene.find(next_id)

INSERT INTO "tmp_scenes" ("json_data", "created_at", "updated_at") VALUES (?, ?, ?)
---
  def create
    scene = Scene.new(scene_params)
    scene.save

INSERT INTO "tmp_scenes" ("json_data", "created_at", "updated_at") VALUES (?, ?, ?)
---
  def create_tmp
    data = TmpScene.new(scene_params)
    data.save